/* 생성자?
*  new 클래스();
*  필드의 값을 설정
*  메소드를 호출해서 객체를 사용할 수 있도록 준비하는 역할을 수행
*  
*  기본 생성자(Default Constructor)
*  모든 클래스는 생성자가 반드시 존재, 하나 이상을 가질 수 있다.
*  생성자 선언을 생략하면 컴파일러는 다음과 같은 기본 생성자를 추가시킨다.
*  public class () {}
*  소스파일 ~ .java >>> 컴파일러 >>> 바이트코드파일 ~.class 
*
*  객체는 클래스의 인스턴스라고도 한다.
*  객체는 모든 인스턴스를 대표하는 포괄적인 의미를 갖는다.
*  
*  인스턴스란?
*  소프트웨어 안에 구현된 구체적인 실체
*  객체를 소프트웨어에 실체화하면 그것을 인스턴스라고 한다.
*  실체화 된 인스턴스는 메모리에 할당된다.
*  
*  인스턴스는 객체에 포함된다고 볼 수있다.
*  인스턴스라는 용어는 반드시 클래스와 객체 사이의 관계로 한정지어서 사용할 필요는 없다.
*  어떤 원본으로부터의 생성된 복제본을 의미한다.
*
*/