package Test;
public class ArrayStudy{
	public static void main(String[] args) {
		ArrayNandom dom1 = new ArrayNandom();
		dom1.L1();
		dom1.L2();
		dom1.L7();
		dom1.L9();
	}	//자 문제가 머냐 L4를 호출이 안돼 파라미터 값을 넣어주면 메인에 들어오지 않는데 
}		//메인에 안넣어주면 호출이 안되고 옹 호출할려면 생성자에 변수.메소드(); 해서 호출 
		//생성자 없이 그냥 메소드(); 이거는 걍 값 넣어주기 하는건가 
		//쩃든 문제는 L4를 해야하는데 호출이 안댕
		//L5메소드에서 생성자를 만들어서 L3호출 시도
		//안됨 왜 안대지 , 아니 리턴만들어서 값 넘기는거 잘 못하겠어
		//System.out.println()
		//또 꺠달은거 매개값을 받는 함수는 호출을 하면 꼬여버린다! 0값을 또 받고 
		// null 값을 또 받기떄문에 , 아무리 0 이랑 null을 넣어줘도 1번 실행되는것이 아니라
		//그 값까지 받아서 2번 실행되는것이기 떄문!
		//그리고 너무 좋은 꿀팁 실행흐름을 모르는것이기 떄문에 어디서 삐꾸났는지 모르는것
		//흐름을 파악하기 위해선 어느부분에서 출력을 해줘라!
		//위에 붙일수도 있다!1을 떼서 1에 붙여서 넣어주고 또 1넣어주고 1>2>3 으로 가지수가 나뉠수 있다